# Class 4: Let's do some work with Pandas

![Panda](https://c.tenor.com/HjWiWdQbvd0AAAAM/cute-bear.gif)

In [1]:
import pandas as pd
import numpy as np

### Series

In [2]:
gdp = {"GDP": [5974.7, 10031.0, 14681.1]}

In [3]:
gdp_s= pd.Series(gdp,name='GDP')
gdp_s

GDP    [5974.7, 10031.0, 14681.1]
Name: GDP, dtype: object

In [4]:
#we can also create them from an array

cpi = np.array([127.5, 169.3, 217.488])
cpi_s= pd.Series(cpi,name='CPI')
cpi_s

0    127.500
1    169.300
2    217.488
Name: CPI, dtype: float64

### From series to dataframes

In [5]:
# create series from a list, then let's get into dataframes!
year = [1990, 2000, 2010]
country = ["US", "US", "US"]
year_s = pd.Series(year,name='Year')
country_s = pd.Series(country,name='Country')

In [6]:
Series_Df = pd.concat([year_s,country_s],axis=1)
Series_Df

   Year Country
0  1990      US
1  2000      US
2  2010      US

In [7]:
Series_Df = pd.concat([year_s,country_s],axis=0)
Series_Df

0    1990
1    2000
2    2010
0      US
1      US
2      US
dtype: object

In [8]:
data = {"GDP": [5974.7, 10031.0, 14681.1],
                   "CPI": [127.5, 169.3, 217.488],
                   "Year": [1990, 2000, 2010],
                   "Country": ["US", "US", "US"]}

df = pd.DataFrame(data)

In [9]:
df

       GDP      CPI  Year Country
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

## Breaking up a dataframe

In [10]:
df.shape

(3, 4)

In [11]:
df.columns

Index(['GDP', 'CPI', 'Year', 'Country'], dtype='object')

In [12]:
df.columns.tolist()

['GDP', 'CPI', 'Year', 'Country']

In [13]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
df.index.tolist()

[0, 1, 2]

In [15]:
pwt_data = {'countrycode': ['CHN', 'CHN', 'CHN', 'FRA', 'FRA', 'FRA'],
        'pop': [1124.8, 1246.8, 1318.2, 58.2, 60.8, 64.7],
        'rgdpe': [2.611, 4.951, 11.106, 1.294, 1.753, 2.032],
        'year': [1990, 2000, 2010, 1990, 2000, 2010]}

pwt = pd.DataFrame(pwt_data)

a) What are the dimensions of pwt?

b) What dtypes are the variables? What do they mean?

In [16]:
pwt.shape

(6, 4)

In [17]:
pwt

  countrycode     pop   rgdpe  year
0         CHN  1124.8   2.611  1990
1         CHN  1246.8   4.951  2000
2         CHN  1318.2  11.106  2010
3         FRA    58.2   1.294  1990
4         FRA    60.8   1.753  2000
5         FRA    64.7   2.032  2010

In [18]:
pwt.dtypes

countrycode     object
pop            float64
rgdpe          float64
year             int64
dtype: object

## Columns

In [19]:
df

       GDP      CPI  Year Country
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

In [20]:
df['CPI']

0    127.500
1    169.300
2    217.488
Name: CPI, dtype: float64

In [21]:
df.CPI

0    127.500
1    169.300
2    217.488
Name: CPI, dtype: float64

In [22]:
df.iloc[:,1]

0    127.500
1    169.300
2    217.488
Name: CPI, dtype: float64

In [23]:
df[["CPI","Country"]]

       CPI Country
0  127.500      US
1  169.300      US
2  217.488      US

In [24]:
df.iloc[:, [1,3]]

       CPI Country
0  127.500      US
1  169.300      US
2  217.488      US

In [25]:
df.columns = ["gdp", "cpi", "year", "country"]
df

       gdp      cpi  year country
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

In [26]:
df.columns = [var.upper() for var in df.columns]
df

       GDP      CPI  YEAR COUNTRY
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

In [27]:
df = df.rename(columns = {"GDP":"NGDP"})

df

      NGDP      CPI  YEAR COUNTRY
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

In [28]:
namelist = ["NGDP","CPI"]

df[namelist]

      NGDP      CPI
0   5974.7  127.500
1  10031.0  169.300
2  14681.1  217.488

## Playing with rows

In [29]:
pwt

  countrycode     pop   rgdpe  year
0         CHN  1124.8   2.611  1990
1         CHN  1246.8   4.951  2000
2         CHN  1318.2  11.106  2010
3         FRA    58.2   1.294  1990
4         FRA    60.8   1.753  2000
5         FRA    64.7   2.032  2010

In [30]:
pwt.iloc[1,]

countrycode       CHN
pop            1246.8
rgdpe           4.951
year             2000
Name: 1, dtype: object

In [31]:
pwt.iloc[0:2,]

  countrycode     pop  rgdpe  year
0         CHN  1124.8  2.611  1990
1         CHN  1246.8  4.951  2000

In [32]:
pwt.loc[pwt['year']==2000]

  countrycode     pop  rgdpe  year
1         CHN  1246.8  4.951  2000
4         FRA    60.8  1.753  2000

In [33]:
pwt[pwt['year']==2000]

  countrycode     pop  rgdpe  year
1         CHN  1246.8  4.951  2000
4         FRA    60.8  1.753  2000

In [34]:
pwt['year']==2000

0    False
1     True
2    False
3    False
4     True
5    False
Name: year, dtype: bool

## Using values as indices

In [36]:
pwt.set_index(["year"])

     countrycode     pop   rgdpe
year
1990         CHN  1124.8   2.611
2000         CHN  1246.8   4.951
2010         CHN  1318.2  11.106
1990         FRA    58.2   1.294
2000         FRA    60.8   1.753
2010         FRA    64.7   2.032

In [37]:
pwt.set_index(["year"]).loc[2000]

     countrycode     pop  rgdpe
year
2000         CHN  1246.8  4.951
2000         FRA    60.8  1.753

In [40]:
pwt.set_index(["year"], inplace = False)
# inplace=True makes a replacement in the dataframe

     countrycode     pop   rgdpe
year
1990         CHN  1124.8   2.611
2000         CHN  1246.8   4.951
2010         CHN  1318.2  11.106
1990         FRA    58.2   1.294
2000         FRA    60.8   1.753
2010         FRA    64.7   2.032

In [39]:
pwt

  countrycode     pop   rgdpe  year
0         CHN  1124.8   2.611  1990
1         CHN  1246.8   4.951  2000
2         CHN  1318.2  11.106  2010
3         FRA    58.2   1.294  1990
4         FRA    60.8   1.753  2000
5         FRA    64.7   2.032  2010

In [41]:
pwt.set_index(["year"], inplace = True)
pwt

     countrycode     pop   rgdpe
year
1990         CHN  1124.8   2.611
2000         CHN  1246.8   4.951
2010         CHN  1318.2  11.106
1990         FRA    58.2   1.294
2000         FRA    60.8   1.753
2010         FRA    64.7   2.032

In [42]:
# resetting

pwt=pwt.reset_index()

In [43]:
pwt

   year countrycode     pop   rgdpe
0  1990         CHN  1124.8   2.611
1  2000         CHN  1246.8   4.951
2  2010         CHN  1318.2  11.106
3  1990         FRA    58.2   1.294
4  2000         FRA    60.8   1.753
5  2010         FRA    64.7   2.032

**Exercise .** How would you extract all rows after 1990?

In [44]:
pwt.loc[pwt['year']>=2000]

   year countrycode     pop   rgdpe
1  2000         CHN  1246.8   4.951
2  2010         CHN  1318.2  11.106
4  2000         FRA    60.8   1.753
5  2010         FRA    64.7   2.032

In [45]:
pwt.loc[pwt['year']>1990]

   year countrycode     pop   rgdpe
1  2000         CHN  1246.8   4.951
2  2010         CHN  1318.2  11.106
4  2000         FRA    60.8   1.753
5  2010         FRA    64.7   2.032

In [46]:
pwt.loc[pwt['year']!=1990]

   year countrycode     pop   rgdpe
1  2000         CHN  1246.8   4.951
2  2010         CHN  1318.2  11.106
4  2000         FRA    60.8   1.753
5  2010         FRA    64.7   2.032

In [93]:
#Show how to do using list comprehension with iloc


pwt.iloc[[i for i in (list(range(1,3))+list(range(4,6)))],]

   year countrycode     pop   rgdpe
1  2000         CHN  1246.8   4.951
2  2010         CHN  1318.2  11.106
4  2000         FRA    60.8   1.753
5  2010         FRA    64.7   2.032

In [97]:
#using concat

pd.concat([pwt.iloc[1:3,], pwt.iloc[4:6,]], axis=0)

   year countrycode     pop   rgdpe
1  2000         CHN  1246.8   4.951
2  2010         CHN  1318.2  11.106
4  2000         FRA    60.8   1.753
5  2010         FRA    64.7   2.032

### Remove Stuff by Column or Row

In [53]:
df=pd.DataFrame(data)
df

       GDP      CPI  Year Country
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

In [54]:
df.drop("CPI", axis = 1)

       GDP  Year Country
0   5974.7  1990      US
1  10031.0  2000      US
2  14681.1  2010      US

In [55]:
df

       GDP      CPI  Year Country
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

In [56]:
df.drop(0, axis = 0)

       GDP      CPI  Year Country
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

In [57]:
df

       GDP      CPI  Year Country
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

**Exercise** How would you drop one year from the data set?

## Conditional Selection

In [58]:
# Here we select rows with CPI larger than 170
df[df.CPI>170]

       GDP      CPI  Year Country
2  14681.1  217.488  2010      US

In [59]:
# if we want to select the particular rows while selecting the specified columns
df.loc[df.CPI>170,['GDP','Year']]

       GDP  Year
2  14681.1  2010

## Calculations on a Dataframe

In [60]:
df["GDP"].dtypes

dtype('float64')

In [61]:
df["GDP"] + df["GDP"]

0    11949.4
1    20062.0
2    29362.2
Name: GDP, dtype: float64

In [62]:
df["GDP"] / df["CPI"] #real gdp!

0    46.860392
1    59.249852
2    67.503035
dtype: float64

In [63]:
100*df["GDP"] / df["GDP"][0]

0    100.000000
1    167.891275
2    245.721124
Name: GDP, dtype: float64

In [64]:
df

       GDP      CPI  Year Country
0   5974.7  127.500  1990      US
1  10031.0  169.300  2000      US
2  14681.1  217.488  2010      US

In [65]:
df['RGDP'] = df['GDP']/df['CPI']

In [66]:
df

       GDP      CPI  Year Country       RGDP
0   5974.7  127.500  1990      US  46.860392
1  10031.0  169.300  2000      US  59.249852
2  14681.1  217.488  2010      US  67.503035

In [67]:
df['GDP_div_1000'] = df['GDP'] / 1000

In [68]:
df

       GDP      CPI  Year Country       RGDP  GDP_div_1000
0   5974.7  127.500  1990      US  46.860392        5.9747
1  10031.0  169.300  2000      US  59.249852       10.0310
2  14681.1  217.488  2010      US  67.503035       14.6811

### Operations across rows/columns

In [69]:
df.sum(axis=0)

GDP                30686.8
CPI                514.288
Year                  6000
Country             USUSUS
RGDP            173.613279
GDP_div_1000       30.6868
dtype: object

In [70]:
df.sum(axis=1)

0     8145.035092
1    12269.580852
2    16990.772135
dtype: float64

In [71]:
df.var(axis=0)

GDP             1.897973e+07
CPI             2.027861e+03
Year            1.000000e+02
RGDP            1.079554e+02
GDP_div_1000    1.897973e+01
dtype: float64

In [72]:
df.var(axis=1)

0    6.601827e+06
1    1.863618e+07
2    4.047240e+07
dtype: float64

**Exercise.** Can you select the year 2010 and compute the row sum of df?

In [74]:
df[df['Year']==2000].sum(axis=1)

1    12269.580852
dtype: float64

## Simple Statistics

In [75]:
test = pd.DataFrame(df.mean(axis=0))

test

                         0
GDP           10228.933333
CPI             171.429333
Year           2000.000000
RGDP             57.871093
GDP_div_1000     10.228933

In [76]:
test.loc["CPI"]

0    171.429333
Name: CPI, dtype: float64

In [77]:
sumstate = df.describe() 
sumstate

                GDP         CPI    Year       RGDP  GDP_div_1000
count      3.000000    3.000000     3.0   3.000000      3.000000
mean   10228.933333  171.429333  2000.0  57.871093     10.228933
std     4356.573590   45.031773    10.0  10.390159      4.356574
min     5974.700000  127.500000  1990.0  46.860392      5.974700
25%     8002.850000  148.400000  1995.0  53.055122      8.002850
50%    10031.000000  169.300000  2000.0  59.249852     10.031000
75%    12356.050000  193.394000  2005.0  63.376443     12.356050
max    14681.100000  217.488000  2010.0  67.503035     14.681100

In [78]:
type(sumstate)

pandas.core.frame.DataFrame

## output and save

In [79]:
pwt.to_csv("pwt.csv")

pwt.to_excel("pwt.xlsx")